Revit 2027 API
ModifierType Enumeration
 An enumerated type listing options to appear in the exported layer name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ModifierType
Public Enumeration ModifierType
public enum class ModifierType
type ModifierType
Members
Member name | Value | Description
AnalyzesAs | 17 |  Signals that the value of the AnalyzesAs parameter will appear in the layer name.
Category | 0 |  Signals that the name of the category will appear in the layer name.
Custom1 | 1 |  Signals that the first custom string will appear in the layer name.
Custom2 | 2 |  Signals that the second custom string will appear in the layer name.
Custom3 | 3 |  Signals that the third custom string will appear in the layer name.
DomainType | 19 |  Signals that the domain type will appear in the layer name.
FabricationService | 20 |  Signals that the fabrication service will appear in the layer name.
FireRating | 4 |  Signals that the value of fire rating will appear in the layer name.
Function | 5 |  Signals that the value of function will appear in the layer name.
Level | 6 |  Signals that the name of the level will appear in the layer name.
PhaseCreated | 7 |  Signals that the name of the created phase will appear in the layer name.
PhaseDemolished | 8 |  Signals that the name of the demolition phase will appear in the layer name.
PhaseStatus | 9 |  Signals that the value of of phase status will appear in the layer name.
StructuralMaterialType | 10 |  Signals that the value of structural material type will appear in the layer name.
StructuralUsage | 11 |  Signals that the value of structural usage will appear in the layer name.
SystemClassification | 18 |  Signals that the system classification will appear in the layer name.
SystemName | 12 |  Signals that the system name will appear in the layer name.
SystemType | 13 |  Signals that the system type will appear in the layer name.
Underlay | 14 |  Signals that the name of the underlay will appear in the layer name.
UnknownType | -1 |  An unknown (default) type of modifier, not acceptable for assignment.
ViewType | 15 |  Signals that the view type will appear in the layer name.
Workset | 16 |  Signals that the name of the workset will appear in the layer name.
See Also
Reference
Autodesk.Revit.DB Namespace